[
  {
    "path": "tutorials/2021-08-04-how-to-making-a-phd-website-with-r/",
    "title": "How To Make A Website with R Studio",
    "description": "In this tutorial I describe how to create a Distill website with R Studio and Github Pages. I also describe how I created the profile homepage with the `postcards` package and made some styling (CSS) adjustments.",
    "author": [
      {
        "name": "Sally A.M. Hogenboom",
        "url": {}
      }
    ],
    "date": "2021-08-04",
    "categories": [],
    "contents": "\nBackground Knowledge\nThis tutorial is relevant for you if you..\n… have R and R Studio installed\n… know how to install R packages\n… have a Github account\n… know how to use your Terminal / Command Prompt\n… have basic knowledge of Git\nI will try and describe the steps as detailed as possible. However, I will not include directions such as “upper-right corner” because user interfaces are known to change.\nCreating the Website\n\nObjective: Creating an empty/shell website\n\nThere are multiple ways in which you can use the R Studio environment for creating websites. I have personally tried two alternatives: Hugo/Blogdown and Distill. In this tutorial I will describe the process of creating a Distill based website, as I found it to be the most intuitive and easy-to-use of both alternatives.\nDistill has excellent documentation available. Some of the steps I describe here will also be included in their documentation, but I will try and go beyond what they have already described.\nOpen R Studio\nInstall the Distill package:\n\n\ninstall.packages(\"distill\")\n \n\n\nCreate a new R Studio project (New Project... > New Directory > Distill Website)\n\n\n\nDirectory name: the name of the folder that is automatically created for this new project. I named mine ‘Website’.\nCreate project as a subdirectory of...: the folder where you want to store your website. I stored mine in the ‘Admin’ folder.\nTitle: the name of your website which is shown in the ‘header’ of your website. This can easily be adjusted later on.\nConfigure for Github Pages: please select this option as it prevents some manual steps later on.\nOpen in new session: I chose to start this project with a new/fresh R Studio session, but this is not a mandatory step.\nBuild the empty/shell website:\n\n\nrmarkdown::render_site()\n \n\n\nCreating a Github Page\n\nObjective: Putting the Website Online\n\nIn order to put your website online it must be hosted. I like to envision ‘hosting’ as a town (the provider) in an online world. I have opted to use the provider Github Pages because (1) it is free (!) and (2) it forces me to version control my website.\nGithub\nCreate a new - empty and public - repository: USERNAME.github.io\nTerminal\nOpen a new terminal at the folder where you stored your website\nInitialize git for the foldergit init\nAdd all filesgit add -A\nCommit the filesgit commit -m \"Initialize Website\"\nCreate the main branchgit branch -M main\nConnect the folder and the Github Repositorygit remote add origin https://github.com/SHogenboom/shogenboom.github.io.git\nPush the local files to the Github Repositorygit push -u origin main\nGithub\nOpen Settings > Pages\nChange the source of the page to the sub-folder /docs\nTerminal\nPull the changes that were made to the repository (CNAME)\nWeb browser\nYour website is now online @ https://USERNAME.github.io\nAdding a Profile Page\n\nObjective: Converting your homepage to a profile page\n\nI wanted people to land on a sort of ‘Home’ page with some basic profile information. Luckily, the Distill documentation clearly describes how you can use the postcards package to create a profile/landing page.\nBefore you get started, check out the postcards documentation to see the profile pages from which you can choose.\nR Studio\nCreate a new postcard:postcards::create_postcard(file = \"home.Rmd\",template = \"jolla\")\nCopy the yaml header to the index.Rmd file and update with your personal information. My header now looks like this:\ntitle: \"Sally A.M. Hogenboom\"\nimage: \"images/avatar.jpg\"\nlinks:\n  - label: GitHub\n    url: \"https://github.com/SHogenboom\"\n  - label: Email\n    url: \"mailto:s.a.m.hogenboom@uva.nl\"\noutput:\n  postcards::jolla\nsite: distill::distill_website\nRe-build the websitermarkdown::render_site(encoding = 'UTF-8')\nTerminal\nAdd the changesgit add -A\nAdd an informative message for the version controlgit commit -m \"Add profile page\"\nPush the changes so they show up onlinegit push\nCustom Styling\nI really love the Distill framework but have opted to make some custom styling changes. The process of adding custom styling (CSS) to your website is described in detail in their documentation.\nIn my own words the steps were as follows:\nR Studio\nCreate a new theme:\n\n\ndistill::create_theme()\n\n\n\nAdd the custom css file to your website:\nOpen _site.yml\nChange the output format to (keep the tab indents!):\noutput:\n  distill::distill_article:\n    theme: theme.css\nUpdate the theme.css file as desired (see example changes below)\nAdjustments\nIf you also want to make the adjustments shown below, add the displayed CSS code to the theme.css file.\n\n\n\nReduce the spacing between bullet-points\n\nBefore\n\n\n\nAfter\n\n\n\nCSS\n\n/* Decrease spacing between elements of bullet lists */\n/* 0.1em creates a small space between lines of text dependent on the font-size*/\nd-article li, d-article ul, di-article ol {\n  margin-bottom: 0.1em;\n}\n\n\nCustom URL\nbuy it\nGithub\nOpen Settings > Pages\nIn the custom domain field add the URL you have purchased.\nYour website is now accesible from the custom URL.\n\n\n\n",
    "preview": "tutorials/2021-08-04-how-to-making-a-phd-website-with-r/images/new-distill-project.png",
    "last_modified": "2021-08-04T17:20:02+02:00",
    "input_file": {}
  }
]
