[
  {
    "path": "posts/2021-08-04-how-to-making-a-phd-website-with-r/",
    "title": "How To: Making A (PhD) Website with R",
    "description": "A Step-by-step tutorial of how to create a website with R Studio.",
    "author": [
      {
        "name": "Sally A.M. Hogenboom",
        "url": {}
      }
    ],
    "date": "2021-08-04",
    "categories": [],
    "contents": "\nBackground Knowledge\nThis tutorial is relevant for you if you..\n… have R and R Studio installed\n… know how to install R packages\n… have a Github account\n… know how to use your Terminal / Command Prompt\n… have basic knowledge of Git\nI will try and describe the steps as detailed as possible. However, I will not include directions such as “upper-right corner” because user interfaces are known to change.\nCreating the Website\n\nObjective: Creating an empty (shell) website\n\nThere are multiple ways in which you can use the R Studio environment for creating websites. I have personally tried two alternatives: Hugo/Blogdown and Distill. In this tutorial I will describe the process of creating a Distill based website, as I found it to be the most intuitive and easy-to-use of both alternatives.\nDistill has excellent documentation available. Some of the steps I describe here will also be included in their documentation, but I will try and go beyond what they have already described.\nOpen R Studio\nInstall the Distill package:\n\n\ninstall.packages(\"distill\")\n \n\n\nCreate a new R Studio project (New Project... > New Directory > Distill Website)\n\n\n\nDirectory name: the name of the folder that is automatically created for this new project. I named mine ‘Website’.\nCreate project as a subdirectory of...: the folder where you want to store your website. I stored mine in the ‘Admin’ folder.\nTitle: the name of your website which is shown in the ‘header’ of your website. This can easily be adjusted later on.\nConfigure for Github Pages: please select this option as it prevents some manual steps later on.\nOpen in new session: I chose to start this project with a new/fresh R Studio session, but this is not a mandatory step.\nBuild the empty/shell website:\n\n\nrmarkdown::render_site()\n \n\n\nCreating a Github Page\n\nObjective: Launching the Website Online\n\nEach website must by hosted. I like to envision it as a town (the provider) in an online world. I have opted to use Github Pages because (1) it is free and (2) it forces me to version control my website.\nGithub 1. Create a new - empty and public - repository: USERNAME.github.io\nTerminal 1. Open a new terminal at the Website folder 1. Initialize git git init 1. Add all files git add -A 1. Commit the files git commit -m \"Initialize Website\" 1. Create the main branch git branch -M main 1. Connect the folder and the Github Repository git remote add origin https://github.com/SHogenboom/shogenboom.github.io.git 1. Push the local files to the Github Repository git push -u origin main\nGithub * Open Settings > Pages * Change the source of the page to the sub-folder /docs\nWeb browser * Your website is now online @ https://USERNAME.github.io\nCustom Styling\nI really love the Distill framework but have opted to make some custom styling changes. The process of adding custom styling (CSS) to your website is described in detail in their documentation.\nIn my own words the steps were as follows:\nOpen R Studio\nOpen your website project\nCreate a new theme from the Console:\n\n\ndistill::create_theme()\n\n\n\nAdd the custom css file to your website:\nOpen _site.yml\nChange the output format to (keep the tab indents!):\noutput:\n  distill::distill_article:\n    theme: theme.css\nUpdate the theme.css file as desired (see example changes below)\nAdjustments\nIf you also want to make the adjustments shown below, add the displayed CSS code to the theme.css file.\n\n\n\nReduce the spacing between bullet-points\n\nBefore\n\n\n\nAfter\n\n\n\nCSS\n\n/* Decrease spacing between elements of bullet lists */\n/* 0.1em creates a small space between lines of text dependent on the font-size*/\nd-article li, d-article ul, di-article ol {\n  margin-bottom: 0.1em;\n}\n\n\n\n\n\n",
    "preview": "posts/2021-08-04-how-to-making-a-phd-website-with-r/images/new-distill-project.png",
    "last_modified": "2021-08-04T15:37:32+02:00",
    "input_file": {}
  }
]
